import feedparser
import html
import requests
from pprint import pprint
from bs4 import BeautifulSoup

'''
這個程式會抓到文章的分類和標籤 
執行可看到歸類好的 Dict
'''

d = feedparser.parse('https://news.pts.org.tw/xml/newsfeed.xml')

# 存所有新聞的字典
all_news_dict = {}

for item in d["entries"]:
    '''<========== RSS 內容 ==========>'''

    # 標題
    title = item["title"]

    # 新聞連節
    link = item["links"][0]["href"]
    
    soup = BeautifulSoup(html.unescape(html.unescape(item['content'][0]["value"])),'html.parser')

    # 圖片網址
    img_url =  soup.find_all("img")[0].get("src")

    # 新聞簡介
    news_text = "".join([p.find(text=True) for p in soup.find_all("p")])
    

    '''<=== 抓取網頁上的 公視分類 和 文章標籤 ===>'''
    r = requests.get(link)
    soup = BeautifulSoup(r.text, "html.parser")

    # 分類
    category = ''.join(soup.find_all("li", class_="breadcrumb-item")[1].find(text=True))

    # 標籤們
    tags = set(''.join(tag.find(text=True)) for tag in soup.find("ul", class_="tag-list").findAll("li"))
    if "..." in tags:
        tags.remove("...")

    '''<======= 分類存進 all_news_dict =======>'''
    if category not in all_news_dict:
        all_news_dict[category] = []
    all_news_dict[category].append({"title":title, "link":link, "tags":list(tags)})

pprint(all_news_dict)

'''格式長醬子

tags_dict_PTS = {
  "海地強震":[{
  'link': 'https://news.pts.org.tw/article/540157',
  'tags': ['海地強震', '熱帶風暴', '海地', '足球場', '生還者'],
  'title': '海地強震》海地全國進入緊急狀態 熱帶風暴恐影響搜救'},
         }
         ,{}],
 "熱帶風暴":[{
  'link': 'https://news.pts.org.tw/article/540157',
  'tags': ['海地強震', '熱帶風暴', '海地', '足球場', '生還者'],
  'title': '海地強震》海地全國進入緊急狀態 熱帶風暴恐影響搜救'},
         }
         ,{}],
  "海地":[{
  'link': 'https://news.pts.org.tw/article/540157',
  'tags': ['海地強震', '熱帶風暴', '海地', '足球場', '生還者'],
  'title': '海地強震》海地全國進入緊急狀態 熱帶風暴恐影響搜救'},
         }
         ,{}],
  "足球場":[{
  'link': 'https://news.pts.org.tw/article/540157',
  'tags': ['海地強震', '熱帶風暴', '海地', '足球場', '生還者'],
  'title': '海地強震》海地全國進入緊急狀態 熱帶風暴恐影響搜救'},
         }
         ,{}],
  "生還者":[{
  'link': 'https://news.pts.org.tw/article/540157',
  'tags': ['海地強震', '熱帶風暴', '海地', '足球場', '生還者'],
  'title': '海地強震》海地全國進入緊急狀態 熱帶風暴恐影響搜救'},
         }
         ,{}],
  "甘尼":[{
  'link': 'https://news.pts.org.tw/article/540156',
  'tags': ['甘尼', '阿富汗', '塔利班', '烏茲別克', '美聯社', '喀布爾'],'title': '阿富汗政府垮台》塔利班拿下首都準備接手政權 強調女性受教權不會改變'},
         ,{}],
  "阿富汗":[{
  'link': 'https://news.pts.org.tw/article/540156',
  'tags': ['甘尼', '阿富汗', '塔利班', '烏茲別克', '美聯社', '喀布爾'],'title': '阿富汗政府垮台》塔利班拿下首都準備接手政權 強調女性受教權不會改變'},
         ,{}],
  "塔利班"":[{
  'link': 'https://news.pts.org.tw/article/540156',
  'tags': ['甘尼', '阿富汗', '塔利班', '烏茲別克', '美聯社', '喀布爾'],'title': '阿富汗政府垮台》塔利班拿下首都準備接手政權 強調女性受教權不會改變'},
         ,{}],
  "烏茲別克":[{
  'link': 'https://news.pts.org.tw/article/540156',
  'tags': ['甘尼', '阿富汗', '塔利班', '烏茲別克', '美聯社', '喀布爾'],'title': '阿富汗政府垮台》塔利班拿下首都準備接手政權 強調女性受教權不會改變'},
         ,{}],
  "美聯社":[{
  'link': 'https://news.pts.org.tw/article/540156',
  'tags': ['甘尼', '阿富汗', '塔利班', '烏茲別克', '美聯社', '喀布爾'],'title': '阿富汗政府垮台》塔利班拿下首都準備接手政權 強調女性受教權不會改變'},
         ,{}],
  "喀布爾":[{
  'link': 'https://news.pts.org.tw/article/540156',
  'tags': ['甘尼', '阿富汗', '塔利班', '烏茲別克', '美聯社', '喀布爾'],'title': '阿富汗政府垮台》塔利班拿下首都準備接手政權 強調女性受教權不會改變'},
         ,{}],
   "美軍":[{
  'link':'https://news.pts.org.tw/article/540140',
  'tags':  ['美軍', '撤離', '阿富汗', '塔利班', '直升機', '喀布爾'],
  'title': '喀布爾四面楚歌 美軍派5千兵力及直升機撤離使館人員'},
         ,{}],
  "撤離":[{
  'link':'https://news.pts.org.tw/article/540140',
  'tags':  ['美軍', '撤離', '阿富汗', '塔利班', '直升機', '喀布爾'],
  'title': '喀布爾四面楚歌 美軍派5千兵力及直升機撤離使館人員'},
         ,{}],
  "阿富汗":[{
  'link':'https://news.pts.org.tw/article/540140',
  'tags':  ['美軍', '撤離', '阿富汗', '塔利班', '直升機', '喀布爾'],
  'title': '喀布爾四面楚歌 美軍派5千兵力及直升機撤離使館人員'},
         ,{}],
  "塔利班":[{
  'link':'https://news.pts.org.tw/article/540140',
  'tags': ['美軍', '撤離', '阿富汗', '塔利班', '直升機', '喀布爾'],
  'title': '喀布爾四面楚歌 美軍派5千兵力及直升機撤離使館人員'},
         ,{}],
  "直升機":[{
  'link':'https://news.pts.org.tw/article/540140',
  'tags':  ['美軍', '撤離', '阿富汗', '塔利班', '直升機', '喀布爾'],
  'title': '喀布爾四面楚歌 美軍派5千兵力及直升機撤離使館人員'},
         ,{}],
  "喀布爾":[{
  'link':'https://news.pts.org.tw/article/540140',
  'tags':  ['美軍', '撤離', '阿富汗', '塔利班', '直升機', '喀布爾'],
  'title': '喀布爾四面楚歌 美軍派5千兵力及直升機撤離使館人員'},
         ,{}],
  "團體":[{
  'link':'https://news.pts.org.tw/article/540139',
  'tags':['團體', '港版國安法', '香港', '民陣', '港府', '解散', '反送中運動'],
  'title': '香港民陣不敵國安法打壓今無奈宣布解散 571萬資產將捐出'},
         ,{}],
  '港版國安法':[{
  'link':'https://news.pts.org.tw/article/540139',
  'tags':['團體', '港版國安法', '香港', '民陣', '港府', '解散', '反送中運動'],
  'title': '香港民陣不敵國安法打壓今無奈宣布解散 571萬資產將捐出'},
         ,{}],
  '香港':[{
  'link':'https://news.pts.org.tw/article/540139',
  'tags':['團體', '港版國安法', '香港', '民陣', '港府', '解散', '反送中運動'],
  'title': '香港民陣不敵國安法打壓今無奈宣布解散 571萬資產將捐出'},
         ,{}],
  "民陣":[{
  'link':'https://news.pts.org.tw/article/540139',
  'tags':['團體', '港版國安法', '香港', '民陣', '港府', '解散', '反送中運動'],
  'title': '香港民陣不敵國安法打壓今無奈宣布解散 571萬資產將捐出'},
         ,{}],
  '港府':[{
  'link':'https://news.pts.org.tw/article/540139',
  'tags':['團體', '港版國安法', '香港', '民陣', '港府', '解散', '反送中運動'],
  'title': '香港民陣不敵國安法打壓今無奈宣布解散 571萬資產將捐出'},
         ,{}],
  "解散":[{
  'link':'https://news.pts.org.tw/article/540139',
  'tags':['團體', '港版國安法', '香港', '民陣', '港府', '解散', '反送中運動'],
  'title': '香港民陣不敵國安法打壓今無奈宣布解散 571萬資產將捐出'},
         ,{}],
  "超大豪雨":[{
  'link':'https://news.pts.org.tw/article/540139',
  'tags':['超大豪雨', '九州', '土石流', '氣象廳'],
  'title': '日本受鋒面滯留影響降超大豪雨 九州傳土石流災情'},
         ,{}],
  "九州":[{
  'link':'https://news.pts.org.tw/article/540102',
  'tags':['超大豪雨', '九州', '土石流', '氣象廳'],
  'title': '日本受鋒面滯留影響降超大豪雨 九州傳土石流災情'},
         ,{}],
  "土石流":[{
  'link':'https://news.pts.org.tw/article/540102',
  'tags':['超大豪雨', '九州', '土石流', '氣象廳'],
  'title': '日本受鋒面滯留影響降超大豪雨 九州傳土石流災情'},
         ,{}],
  "氣象廳":[{
  'link':'https://news.pts.org.tw/article/540102',
  'tags':['超大豪雨', '九州', '土石流', '氣象廳'],
  'title': '日本受鋒面滯留影響降超大豪雨 九州傳土石流災情'},
         ,{}],
  "芮氏規模":[{
  'link':'https://news.pts.org.tw/article/540084',
  'tags':['芮氏規模', '規模7.2', '海地', '強震', '緊急狀態', '亨利'],
  'title': '海地規模7.2強震釀數百人罹難 全國進入緊急狀態一個月'},
         ,{}],
   "規模7.2":[{
  'link':'https://news.pts.org.tw/article/540084',
  'tags':['芮氏規模', '規模7.2', '海地', '強震', '緊急狀態', '亨利'],
  'title': '海地規模7.2強震釀數百人罹難 全國進入緊急狀態一個月'},
         ,{}],
   "海地":[{
  'link':'https://news.pts.org.tw/article/540084',
  'tags':['芮氏規模', '規模7.2', '海地', '強震', '緊急狀態', '亨利'],
  'title': '海地規模7.2強震釀數百人罹難 全國進入緊急狀態一個月'},
         ,{}],
   "強震":[{
  'link':'https://news.pts.org.tw/article/540084',
  'tags':['芮氏規模', '規模7.2', '海地', '強震', '緊急狀態', '亨利'],
  'title': '海地規模7.2強震釀數百人罹難 全國進入緊急狀態一個月'},
         ,{}],
   "緊急狀態":[{
  'link':'https://news.pts.org.tw/article/540084',
  'tags':['芮氏規模', '規模7.2', '海地', '強震', '緊急狀態', '亨利'],
  'title': '海地規模7.2強震釀數百人罹難 全國進入緊急狀態一個月'},
         ,{}],
   "亨利":[{
  'link':'https://news.pts.org.tw/article/540084',
  'tags':['芮氏規模', '規模7.2', '海地', '強震', '緊急狀態', '亨利'],
  'title': '海地規模7.2強震釀數百人罹難 全國進入緊急狀態一個月'},
         ,{}],
   "確診者足跡":[{
  'link':'https://news.pts.org.tw/article/540141',
  'tags':['確診者足跡', '越南籍', '個案', '傳染力', '本土個案'],,
  'title': '新莊一個案探病前採檢確診Ct值37  曾赴北市及桃園2市場'},
         ,{}],
  "越南籍":[{
  'link':'https://news.pts.org.tw/article/540141',
  'tags':['確診者足跡', '越南籍', '個案', '傳染力', '本土個案'],,
  'title': '新莊一個案探病前採檢確診Ct值37  曾赴北市及桃園2市場'},
         ,{}],
  "個案":[{
  'link':'https://news.pts.org.tw/article/540141',
  'tags':['確診者足跡', '越南籍', '個案', '傳染力', '本土個案'],,
  'title': '新莊一個案探病前採檢確診Ct值37  曾赴北市及桃園2市場'},
         ,{}],
  "傳染力":[{
  'link':'https://news.pts.org.tw/article/540141',
  'tags':['確診者足跡', '越南籍', '個案', '傳染力', '本土個案'],,
  'title': '新莊一個案探病前採檢確診Ct值37  曾赴北市及桃園2市場'},
         ,{}],
  "本土個案":[{
  'link':'https://news.pts.org.tw/article/540141',
  'tags':['確診者足跡', '越南籍', '個案', '傳染力', '本土個案'],,
  'title': '新莊一個案探病前採檢確診Ct值37  曾赴北市及桃園2市場'},
         ,{}],
  "農委會":[{
  'link': 'https://news.pts.org.tw/article/540138',
  'tags': ['農委會', '雜草', '農場', '南投縣', '業者'],
  'title': '集集農場粉色花田是有害雜草 「粉黛亂子草」遭農委會要求移除'},
         ,{}],
  "雜草":[{
  'link': 'https://news.pts.org.tw/article/540138',
  'tags': ['農委會', '雜草', '農場', '南投縣', '業者'],
  'title': '集集農場粉色花田是有害雜草 「粉黛亂子草」遭農委會要求移除'},
         ,{}],
  "農場":[{
  'link': 'https://news.pts.org.tw/article/540138',
  'tags': ['農委會', '雜草', '農場', '南投縣', '業者'],
  'title': '集集農場粉色花田是有害雜草 「粉黛亂子草」遭農委會要求移除'},
         ,{}],
  "南投縣":[{
  'link': 'https://news.pts.org.tw/article/540138',
  'tags': ['農委會', '雜草', '農場', '南投縣', '業者'],
  'title': '集集農場粉色花田是有害雜草 「粉黛亂子草」遭農委會要求移除'},
         ,{}],
  "業者":[{
  'link': 'https://news.pts.org.tw/article/540138',
  'tags': ['農委會', '雜草', '農場', '南投縣', '業者'],
  'title': '集集農場粉色花田是有害雜草 「粉黛亂子草」遭農委會要求移除'},
         ,{}],
  "活動":[{
  'link': 'https://news.pts.org.tw/article/540093',
  'tags': ['活動', '回溫', '開放', '商圈'],
  'title': '赤崁樓推七夕魁星爺祝壽活動 盼活絡赤崁商圈'},
          ,{}],
  "回溫":[{
  'link': 'https://news.pts.org.tw/article/540093',
  'tags': ['活動', '回溫', '開放', '商圈'],
  'title': '赤崁樓推七夕魁星爺祝壽活動 盼活絡赤崁商圈'},
          ,{}],
  "開放":[{
  'link': 'https://news.pts.org.tw/article/540093',
  'tags': ['活動', '回溫', '開放', '商圈'],
  'title': '赤崁樓推七夕魁星爺祝壽活動 盼活絡赤崁商圈'},
          ,{}],
  "商圈":[{
  'link': 'https://news.pts.org.tw/article/540093',
  'tags': ['活動', '回溫', '開放', '商圈'],
  'title': '赤崁樓推七夕魁星爺祝壽活動 盼活絡赤崁商圈'},
          ,{}],
  "居民":[{
  'link': 'https://news.pts.org.tw/article/540075',
  'tags': ['明霸克露橋', '謝宜真', '居民', '公路總局', '土石流'],
  'title': '桃源天氣不穩便道工程屢被土石流摧毀 受困居民已無瓦斯'},
          ,{}],
  "明霸克露橋":[{
  'link': 'https://news.pts.org.tw/article/540075',
  'tags': ['明霸克露橋', '謝宜真', '居民', '公路總局', '土石流'],
  'title': '桃源天氣不穩便道工程屢被土石流摧毀 受困居民已無瓦斯'},
          ,{}],
  "謝宜真":[{
  'link': 'https://news.pts.org.tw/article/540075',
  'tags': ['明霸克露橋', '謝宜真', '居民', '公路總局', '土石流'],
  'title': '桃源天氣不穩便道工程屢被土石流摧毀 受困居民已無瓦斯'},
          ,{}],
  "公路總局":[{
  'link': 'https://news.pts.org.tw/article/540075',
  'tags': ['明霸克露橋', '謝宜真', '居民', '公路總局', '土石流'],
  'title': '桃源天氣不穩便道工程屢被土石流摧毀 受困居民已無瓦斯'},
          ,{}],
  "土石流":[{
  'link': 'https://news.pts.org.tw/article/540075',
  'tags': ['明霸克露橋', '謝宜真', '居民', '公路總局', '土石流'],
  'title': '桃源天氣不穩便道工程屢被土石流摧毀 受困居民已無瓦斯'},
          ,{}],
  "阿里山":[{
  'link': 'https://news.pts.org.tw/article/540074',
  'tags': ['阿里山', '水管', '管線', '車道'],
  'title': '阿里山引水管線遭豪雨破壞 林鐵列車變身載水車'}
          ,{}],
  "水管":[{
  'link': 'https://news.pts.org.tw/article/540074',
  'tags': ['阿里山', '水管', '管線', '車道'],
  'title': '阿里山引水管線遭豪雨破壞 林鐵列車變身載水車'}
          ,{}],
  "管線":[{
  'link': 'https://news.pts.org.tw/article/540074',
  'tags': ['阿里山', '水管', '管線', '車道'],
  'title': '阿里山引水管線遭豪雨破壞 林鐵列車變身載水車'}
          ,{}],
  "車道":[{
  'link': 'https://news.pts.org.tw/article/540074',
  'tags': ['阿里山', '水管', '管線', '車道'],
  'title': '阿里山引水管線遭豪雨破壞 林鐵列車變身載水車'}
          ,{}],
  "指揮中心":[{
  'link': 'https://news.pts.org.tw/article/540145',
  'tags': ['指揮中心', '第二劑', '指揮官', '莫德納疫苗', '陳時中'],
  'title': '自購24.96萬劑莫德納疫苗抵台 陳時中：醫護第二劑一定會保留'}
          ,{}],
  "指揮中心":[{
  'link': 'https://news.pts.org.tw/article/540145',
  'tags': ['指揮中心', '第二劑', '指揮官', '莫德納疫苗', '陳時中'],
  'title': '自購24.96萬劑莫德納疫苗抵台 陳時中：醫護第二劑一定會保留'}
          ,{}],
  "第二劑":[{
  'link': 'https://news.pts.org.tw/article/540145',
  'tags': ['指揮中心', '第二劑', '指揮官', '莫德納疫苗', '陳時中'],
  'title': '自購24.96萬劑莫德納疫苗抵台 陳時中：醫護第二劑一定會保留'}
          ,{}],
  "指揮官":[{
  'link': 'https://news.pts.org.tw/article/540145',
  'tags': ['指揮中心', '第二劑', '指揮官', '莫德納疫苗', '陳時中'],
  'title': '自購24.96萬劑莫德納疫苗抵台 陳時中：醫護第二劑一定會保留'}
          ,{}],
  "莫德納疫苗":[{
  'link': 'https://news.pts.org.tw/article/540145',
  'tags': ['指揮中心', '第二劑', '指揮官', '莫德納疫苗', '陳時中'],
  'title': '自購24.96萬劑莫德納疫苗抵台 陳時中：醫護第二劑一定會保留'}
          ,{}],
  "陳時中":[{
  'link': 'https://news.pts.org.tw/article/540145',
  'tags': ['指揮中心', '第二劑', '指揮官', '莫德納疫苗', '陳時中'],
  'title': '自購24.96萬劑莫德納疫苗抵台 陳時中：醫護第二劑一定會保留'}
          ,{}],
  "搜救隊":[{
  'link': 'https://news.pts.org.tw/article/540144',
  'tags': ['搜救隊', '芮氏規模', '海地強震', '海地', '搜救人員', '總統蔡英文', '消防署'],
  'title': '海地強震》總統蔡英文指示捐50萬美元賑災 消防署50位搜救人員待命中'}
          ,{}],
  "芮氏規模":[{
  'link': 'https://news.pts.org.tw/article/540144',
  'tags': ['搜救隊', '芮氏規模', '海地強震', '海地', '搜救人員', '總統蔡英文', '消防署'],
  'title': '海地強震》總統蔡英文指示捐50萬美元賑災 消防署50位搜救人員待命中'}
          ,{}],
  "海地強震":[{
  'link': 'https://news.pts.org.tw/article/540144',
  'tags': ['搜救隊', '芮氏規模', '海地強震', '海地', '搜救人員', '總統蔡英文', '消防署'],
  'title': '海地強震》總統蔡英文指示捐50萬美元賑災 消防署50位搜救人員待命中'}
          ,{}],
  "海地":[{
  'link': 'https://news.pts.org.tw/article/540144',
  'tags': ['搜救隊', '芮氏規模', '海地強震', '海地', '搜救人員', '總統蔡英文', '消防署'],
  'title': '海地強震》總統蔡英文指示捐50萬美元賑災 消防署50位搜救人員待命中'}
          ,{}],
  "搜救人員":[{
  'link': 'https://news.pts.org.tw/article/540144',
  'tags': ['搜救隊', '芮氏規模', '海地強震', '海地', '搜救人員', '總統蔡英文', '消防署'],
  'title': '海地強震》總統蔡英文指示捐50萬美元賑災 消防署50位搜救人員待命中'}
          ,{}],
  "總統蔡英文"":[{
  'link': 'https://news.pts.org.tw/article/540144',
  'tags': ['搜救隊', '芮氏規模', '海地強震', '海地', '搜救人員', '總統蔡英文', '消防署'],
  'title': '海地強震》總統蔡英文指示捐50萬美元賑災 消防署50位搜救人員待命中'}
          ,{}],
  "消防署"":[{
  'link': 'https://news.pts.org.tw/article/540144',
  'tags': ['搜救隊', '芮氏規模', '海地強震', '海地', '搜救人員', '總統蔡英文', '消防署'],
  'title': '海地強震》總統蔡英文指示捐50萬美元賑災 消防署50位搜救人員待命中'}
          ,{}],
  "張育成":[{
  'link': 'https://news.pts.org.tw/article/540146',
  'tags': ['張育成', '中信兄弟', '封王', '選手', '比賽', '無安打', '帕運'],
  'title': '體育週報》中信兄弟魔術數字降到M1 最快明天封王'}
          ,{}],
   "中信兄弟":[{
  'link': 'https://news.pts.org.tw/article/540146',
  'tags': ['張育成', '中信兄弟', '封王', '選手', '比賽', '無安打', '帕運'],
  'title': '體育週報》中信兄弟魔術數字降到M1 最快明天封王'}
          ,{}],
   "封王":[{
  'link': 'https://news.pts.org.tw/article/540146',
  'tags': ['張育成', '中信兄弟', '封王', '選手', '比賽', '無安打', '帕運'],
  'title': '體育週報》中信兄弟魔術數字降到M1 最快明天封王'}
          ,{}],
  "選手":[{
  'link': 'https://news.pts.org.tw/article/540146',
  'tags': ['張育成', '中信兄弟', '封王', '選手', '比賽', '無安打', '帕運'],
  'title': '體育週報》中信兄弟魔術數字降到M1 最快明天封王'}
          ,{}],
  "比賽":[{
  'link': 'https://news.pts.org.tw/article/540146',
  'tags': ['張育成', '中信兄弟', '封王', '選手', '比賽', '無安打', '帕運'],
  'title': '體育週報》中信兄弟魔術數字降到M1 最快明天封王'}
          ,{}],
  "無安打":[{
  'link': 'https://news.pts.org.tw/article/540146',
  'tags': ['張育成', '中信兄弟', '封王', '選手', '比賽', '無安打', '帕運'],
  'title': '體育週報》中信兄弟魔術數字降到M1 最快明天封王'}
          ,{}],
  "帕運":[{
  'link': 'https://news.pts.org.tw/article/540146',
  'tags': ['張育成', '中信兄弟', '封王', '選手', '比賽', '無安打', '帕運'],
  'title': '體育週報》中信兄弟魔術數字降到M1 最快明天封王'}
          ,{}],
  "線上學習":[{
  'link': 'https://news.pts.org.tw/article/540097',
  'tags': ['線上學習', '學習', '課程', '線上', '上課', '家長'],
  'title': '線上暑期輔導課程缺課率高 家長憂學習成效M型化'}
          ,{}],
  "學習":[{
  'link': 'https://news.pts.org.tw/article/540097',
  'tags': ['線上學習', '學習', '課程', '線上', '上課', '家長'],
  'title': '線上暑期輔導課程缺課率高 家長憂學習成效M型化'}
          ,{}],
  "課程":[{
  'link': 'https://news.pts.org.tw/article/540097',
  'tags': ['線上學習', '學習', '課程', '線上', '上課', '家長'],
  'title': '線上暑期輔導課程缺課率高 家長憂學習成效M型化'}
          ,{}],
  "線上":[{
  'link': 'https://news.pts.org.tw/article/540097',
  'tags': ['線上學習', '學習', '課程', '線上', '上課', '家長'],
  'title': '線上暑期輔導課程缺課率高 家長憂學習成效M型化'}
          ,{}],
  "上課":[{
  'link': 'https://news.pts.org.tw/article/540097',
  'tags': ['線上學習', '學習', '課程', '線上', '上課', '家長'],
  'title': '線上暑期輔導課程缺課率高 家長憂學習成效M型化'}
          ,{}],
  "家長":[{
  'link': 'https://news.pts.org.tw/article/540097',
  'tags': ['線上學習', '學習', '課程', '線上', '上課', '家長'],
  'title': '線上暑期輔導課程缺課率高 家長憂學習成效M型化'}
          ,{}],
  "高端疫苗":[{
  'link': 'https://news.pts.org.tw/article/540168',
  'tags': ['高端疫苗', 'EUA', '申請', '新冠肺炎疫苗', '巴拉圭'],
  'title': '高端已於8/13向巴拉圭申請EUA 第6輪疫苗今天早上十點開放預約'}
          ,{}],
  "EUA":[{
  'link': 'https://news.pts.org.tw/article/540168',
  'tags': ['高端疫苗', 'EUA', '申請', '新冠肺炎疫苗', '巴拉圭'],
  'title': '高端已於8/13向巴拉圭申請EUA 第6輪疫苗今天早上十點開放預約'}
          ,{}],
  "申請":[{
  'link': 'https://news.pts.org.tw/article/540168',
  'tags': ['高端疫苗', 'EUA', '申請', '新冠肺炎疫苗', '巴拉圭'],
  'title': '高端已於8/13向巴拉圭申請EUA 第6輪疫苗今天早上十點開放預約'}
          ,{}],
  "新冠肺炎疫苗":[{
  'link': 'https://news.pts.org.tw/article/540168',
  'tags': ['高端疫苗', 'EUA', '申請', '新冠肺炎疫苗', '巴拉圭'],
  'title': '高端已於8/13向巴拉圭申請EUA 第6輪疫苗今天早上十點開放預約'}
          ,{}],
  "巴拉圭":[{
  'link': 'https://news.pts.org.tw/article/540168',
  'tags': ['高端疫苗', 'EUA', '申請', '新冠肺炎疫苗', '巴拉圭'],
  'title': '高端已於8/13向巴拉圭申請EUA 第6輪疫苗今天早上十點開放預約'}
          ,{}],
  "返國":[{
  'link': 'https://news.pts.org.tw/article/540167',
  'tags': ['返國', '緬甸', '包機返台', '高風險', '台商'],
  'title': '緬甸疫情嚴峻日增3至4千例 台商昨搭包機返台'}
          ,{}],
  "緬甸":[{
  'link': 'https://news.pts.org.tw/article/540167',
  'tags': ['返國', '緬甸', '包機返台', '高風險', '台商'],
  'title': '緬甸疫情嚴峻日增3至4千例 台商昨搭包機返台'}
          ,{}],
  "包機返台":[{
  'link': 'https://news.pts.org.tw/article/540167',
  'tags': ['返國', '緬甸', '包機返台', '高風險', '台商'],
  'title': '緬甸疫情嚴峻日增3至4千例 台商昨搭包機返台'}
          ,{}],
  "高風險":[{
  'link': 'https://news.pts.org.tw/article/540167',
  'tags': ['返國', '緬甸', '包機返台', '高風險', '台商'],
  'title': '緬甸疫情嚴峻日增3至4千例 台商昨搭包機返台'}
          ,{}],
  "台商":[{
  'link': 'https://news.pts.org.tw/article/540167',
  'tags': ['返國', '緬甸', '包機返台', '高風險', '台商'],
  'title': '緬甸疫情嚴峻日增3至4千例 台商昨搭包機返台'}
          ,{}],
  "安全":[{
  'link': 'https://news.pts.org.tw/article/540143',
  'tags': ['安全', '地點', '公路總局', '土石流', '莫拉克風災'],
  'title': '土石流沖毀明壩克露橋搶通進度 公路總局今邀集成大教授商討對策'}
          ,{}],
  "地點":[{
  'link': 'https://news.pts.org.tw/article/540143',
  'tags': ['安全', '地點', '公路總局', '土石流', '莫拉克風災'],
  'title': '土石流沖毀明壩克露橋搶通進度 公路總局今邀集成大教授商討對策'}
          ,{}],
  "公路總局":[{
  'link': 'https://news.pts.org.tw/article/540143',
  'tags': ['安全', '地點', '公路總局', '土石流', '莫拉克風災'],
  'title': '土石流沖毀明壩克露橋搶通進度 公路總局今邀集成大教授商討對策'}
          ,{}],
  "土石流":[{
  'link': 'https://news.pts.org.tw/article/540143',
  'tags': ['安全', '地點', '公路總局', '土石流', '莫拉克風災'],
  'title': '土石流沖毀明壩克露橋搶通進度 公路總局今邀集成大教授商討對策'}
          ,{}],
  "莫拉克風災":[{
  'link': 'https://news.pts.org.tw/article/540143',
  'tags': ['安全', '地點', '公路總局', '土石流', '莫拉克風災'],
  'title': '土石流沖毀明壩克露橋搶通進度 公路總局今邀集成大教授商討對策'}
          ,{}],
  "太平洋":[{
  'link': 'https://news.pts.org.tw/article/540104',
  'tags': ['太平洋', '熱帶性低氣壓', '影響', '熱帶低壓', '氣象預報'],
  'title': '太平洋熱帶低壓距離遠對台暫無影響 18日後動線更明朗'}
          ,{}],
  "熱帶性低氣壓":[{
  'link': 'https://news.pts.org.tw/article/540104',
  'tags': ['太平洋', '熱帶性低氣壓', '影響', '熱帶低壓', '氣象預報'],
  'title': '太平洋熱帶低壓距離遠對台暫無影響 18日後動線更明朗'}
          ,{}],
  "影響":[{
  'link': 'https://news.pts.org.tw/article/540104',
  'tags': ['太平洋', '熱帶性低氣壓', '影響', '熱帶低壓', '氣象預報'],
  'title': '太平洋熱帶低壓距離遠對台暫無影響 18日後動線更明朗'}
          ,{}],
  "熱帶低壓":[{
  'link': 'https://news.pts.org.tw/article/540104',
  'tags': ['太平洋', '熱帶性低氣壓', '影響', '熱帶低壓', '氣象預報'],
  'title': '太平洋熱帶低壓距離遠對台暫無影響 18日後動線更明朗'}
          ,{}],
  "氣象預報":[{
  'link': 'https://news.pts.org.tw/article/540104',
  'tags': ['太平洋', '熱帶性低氣壓', '影響', '熱帶低壓', '氣象預報'],
  'title': '太平洋熱帶低壓距離遠對台暫無影響 18日後動線更明朗'}
          ,{}],
  "病毒株":[{
  'link': 'https://news.pts.org.tw/article/540096',
  'tags': ['病毒株', '族群', '醫師', '危險', '哥倫比亞', '突破性感染'],
  'title': '變種病毒提高「突破性感染」機率 醫：已接種高危族群仍要留意}
          ,{}],
  "族群":[{
  'link': 'https://news.pts.org.tw/article/540096',
  'tags': ['病毒株', '族群', '醫師', '危險', '哥倫比亞', '突破性感染'],
  'title': '變種病毒提高「突破性感染」機率 醫：已接種高危族群仍要留意}
          ,{}],
  "醫師":[{
  'link': 'https://news.pts.org.tw/article/540096',
  'tags': ['病毒株', '族群', '醫師', '危險', '哥倫比亞', '突破性感染'],
  'title': '變種病毒提高「突破性感染」機率 醫：已接種高危族群仍要留意}
          ,{}],
  "危險":[{
  'link': 'https://news.pts.org.tw/article/540096',
  'tags': ['病毒株', '族群', '醫師', '危險', '哥倫比亞', '突破性感染'],
  'title': '變種病毒提高「突破性感染」機率 醫：已接種高危族群仍要留意}
          ,{}],
  "哥倫比亞":[{
  'link': 'https://news.pts.org.tw/article/540096',
  'tags': ['病毒株', '族群', '醫師', '危險', '哥倫比亞', '突破性感染'],
  'title': '變種病毒提高「突破性感染」機率 醫：已接種高危族群仍要留}}
          ,{}],
  "突破性感染":[{
  'link': 'https://news.pts.org.tw/article/540096',
  'tags': ['病毒株', '族群', '醫師', '危險', '哥倫比亞', '突破性感染'],
  'title': '變種病毒提高「突破性感染」機率 醫：已接種高危族群仍要留意}
          ,{}],
  "五倍券":[{
  'link': 'https://news.pts.org.tw/article/540095',
  'tags': ['五倍券', '支持度', '現金', '消基會', '振興經濟', '發現金'],
  'title': '五倍劵議題2萬人網路民調出爐 消基會：9成盼發放現金'}
          ,{}],
  "支持度":[{
  'link': 'https://news.pts.org.tw/article/540095',
  'tags': ['五倍券', '支持度', '現金', '消基會', '振興經濟', '發現金'],
  'title': '五倍劵議題2萬人網路民調出爐 消基會：9成盼發放現金'}
          ,{}],
  "現金":[{
  'link': 'https://news.pts.org.tw/article/540095',
  'tags': ['五倍券', '支持度', '現金', '消基會', '振興經濟', '發現金'],
  'title': '五倍劵議題2萬人網路民調出爐 消基會：9成盼發放現金'}
          ,{}],
  "消基會":[{
  'link': 'https://news.pts.org.tw/article/540095',
  'tags': ['五倍券', '支持度', '現金', '消基會', '振興經濟', '發現金'],
  'title': '五倍劵議題2萬人網路民調出爐 消基會：9成盼發放現金'}
          ,{}],
  "振興經濟":[{
  'link': 'https://news.pts.org.tw/article/540095',
  'tags': ['五倍券', '支持度', '現金', '消基會', '振興經濟', '發現金'],
  'title': '五倍劵議題2萬人網路民調出爐 消基會：9成盼發放現金'}
          ,{}],
  "發現金":[{
  'link': 'https://news.pts.org.tw/article/540095',
  'tags': ['五倍券', '支持度', '現金', '消基會', '振興經濟', '發現金'],
  'title': '五倍劵議題2萬人網路民調出爐 消基會：9成盼發放現金'}
          ,{}],
  "長榮航空":[{
  'link': 'https://news.pts.org.tw/article/540085',
  'tags': ['長榮航空', '安全', '關島'],
  'title': '長榮飛關島落地摩擦 重飛後安全降落'}
          ,{}],
  "安全":[{
  'link': 'https://news.pts.org.tw/article/540085',
  'tags': ['長榮航空', '安全', '關島'],
  'title': '長榮飛關島落地摩擦 重飛後安全降落'}
          ,{}],
  "關島":[{
  'link': 'https://news.pts.org.tw/article/540085',
  'tags': ['長榮航空', '安全', '關島'],
  'title': '長榮飛關島落地摩擦 重飛後安全降落'}
          ,{}],
  "彰化":[{
  'link': 'https://news.pts.org.tw/article/540094',
  'tags': ['彰化', '伸港', '損失'],
  'title': '連日大雨沖淡海水鹽度 彰化伸港、線西牡蠣供應量剩不到兩成'}
          ,{}],
  "伸港":[{
  'link': 'https://news.pts.org.tw/article/540094',
  'tags': ['彰化', '伸港', '損失'],
  'title': '連日大雨沖淡海水鹽度 彰化伸港、線西牡蠣供應量剩不到兩成'}
          ,{}],
  "損失":[{
  'link': 'https://news.pts.org.tw/article/540094',
  'tags': ['彰化', '伸港', '損失'],
  'title': '連日大雨沖淡海水鹽度 彰化伸港、線西牡蠣供應量剩不到兩成'}
          ,{}],
  "防疫警戒":[{
  'link': 'https://news.pts.org.tw/article/540100',
  'tags': ['防疫警戒', '傳染病防治法', '警方'],
  'title': '12人民宅聚賭未開局就被抓 警現場查獲最高罰360萬'}
          ,{}],
  "傳染病防治法":[{
  'link': 'https://news.pts.org.tw/article/540100',
  'tags': ['防疫警戒', '傳染病防治法', '警方'],
  'title': '12人民宅聚賭未開局就被抓 警現場查獲最高罰360萬'}
          ,{}],
  "警方":[{
  'link': 'https://news.pts.org.tw/article/540100',
  'tags': ['防疫警戒', '傳染病防治法', '警方'],
  'title': '12人民宅聚賭未開局就被抓 警現場查獲最高罰360萬'}
          ,{}],
  "官司":[{
  'link': 'https://news.pts.org.tw/article/540099',
  'tags': ['官司', '被害人', '中山分局', '車輛', '濫權'],
  'title': '便衣警認錯車誤衝撞還開槍 國賠官司判警違法濫權要賠36萬'}
          ,{}],
  "被害人":[{
  'link': 'https://news.pts.org.tw/article/540099',
  'tags': ['官司', '被害人', '中山分局', '車輛', '濫權'],
  'title': '便衣警認錯車誤衝撞還開槍 國賠官司判警違法濫權要賠36萬'}
          ,{}],
  "中山分局":[{
  'link': 'https://news.pts.org.tw/article/540099',
  'tags': ['官司', '被害人', '中山分局', '車輛', '濫權'],
  'title': '便衣警認錯車誤衝撞還開槍 國賠官司判警違法濫權要賠36萬'}
          ,{}],
  "官司":[{
  'link': 'https://news.pts.org.tw/article/540099',
  'tags': ['官司', '被害人', '中山分局', '車輛', '濫權'],
  'title': '便衣警認錯車誤衝撞還開槍 國賠官司判警違法濫權要賠36萬'}
          ,{}],
  

  
  }

{'全球: [{'link': 'https://news.pts.org.tw/article/540157',
         'tags': ['海地強震', '熱帶風暴', '海地', '足球場', '生還者'],
         'title': '海地強震》海地全國進入緊急狀態 熱帶風暴恐影響搜救'},
        {'link': 'https://news.pts.org.tw/article/540156',
         'tags'***
        {'link': 'https://news.pts.org.tw/article/540139',
         'tags': ['團體', '港版國安法', '香港', '民陣', '港府', '解散', '反送中運動'],
         'title': '香港民陣不敵國安法打壓今無奈宣布解散 571萬資產將捐出'},
         **********
        {'link': 'https://news.pts.org.tw/article/540102',
         'tags': ['超大豪雨', '九州', '土石流', '氣象廳'],
         'title': '日本受鋒面滯留影響降超大豪雨 九州傳土石流災情'},
         -------------
        {'link': 'https://news.pts.org.tw/article/540084',
         'tags': ['芮氏規模', '規模7.2', '海地', '強震', '緊急狀態', '亨利'],
         'title': '海地規模7.2強震釀數百人罹難 全國進入緊急狀態一個月'}],
 '地方': [{'link': 'https://news.pts.org.tw/article/540141',
         'tags': ['確診者足跡', '越南籍', '個案', '傳染力', '本土個案'],
         'title': '新莊一個案探病前採檢確診Ct值37  曾赴北市及桃園2市場'},
        {'link': 'https://news.pts.org.tw/article/540138',
         'tags': ['農委會', '雜草', '農場', '南投縣', '業者'],
         'title': '集集農場粉色花田是有害雜草 「粉黛亂子草」遭農委會要求移除'},
        {'link': 'https://news.pts.org.tw/article/540093',
         'tags': ['活動', '回溫', '開放', '商圈'],
         'title': '赤崁樓推七夕魁星爺祝壽活動 盼活絡赤崁商圈'},
        {'link': 'https://news.pts.org.tw/article/540075',
         'tags': ['明霸克露橋', '謝宜真', '居民', '公路總局', '土石流'],
         'title': '桃源天氣不穩便道工程屢被土石流摧毀 受困居民已無瓦斯'},
        {'link': 'https://news.pts.org.tw/article/540074',
         'tags': ['阿里山', '水管', '管線', '車道'],
         'title': '阿里山引水管線遭豪雨破壞 林鐵列車變身載水車'}],
 '政治': [{'link': 'https://news.pts.org.tw/article/540145',
         'tags': ['指揮中心', '第二劑', '指揮官', '莫德納疫苗', '陳時中'],
         'title': '自購24.96萬劑莫德納疫苗抵台 陳時中：醫護第二劑一定會保留'},
        {'link': 'https://news.pts.org.tw/article/540144',
         'tags': ['搜救隊', '芮氏規模', '海地強震', '海地', '搜救人員', '總統蔡英文', '消防署'],
         'title': '海地強震》總統蔡英文指示捐50萬美元賑災 消防署50位搜救人員待命中'}],
 '文教科技': [{'link': 'https://news.pts.org.tw/article/540146',
           'tags': ['張育成', '中信兄弟', '封王', '選手', '比賽', '無安打', '帕運'],
           'title': '體育週報》中信兄弟魔術數字降到M1 最快明天封王'},
          {'link': 'https://news.pts.org.tw/article/540097',
           'tags': ['線上學習', '學習', '課程', '線上', '上課', '家長'],
           'title': '線上暑期輔導課程缺課率高 家長憂學習成效M型化'}],
 '生活': [{'link': 'https://news.pts.org.tw/article/540168',
         'tags': ['高端疫苗', 'EUA', '申請', '新冠肺炎疫苗', '巴拉圭'],
         'title': '高端已於8/13向巴拉圭申請EUA 第6輪疫苗今天早上十點開放預約'},
        {'link': 'https://news.pts.org.tw/article/540167',
         'tags': ['返國', '緬甸', '包機返台', '高風險', '台商'],
         'title': '緬甸疫情嚴峻日增3至4千例 台商昨搭包機返台'},
        {'link': 'https://news.pts.org.tw/article/540143',
         'tags': ['安全', '地點', '公路總局', '土石流', '莫拉克風災'],
         'title': '土石流沖毀明壩克露橋搶通進度 公路總局今邀集成大教授商討對策'},
        {'link': 'https://news.pts.org.tw/article/540104',
         'tags': ['太平洋', '熱帶性低氣壓', '影響', '熱帶低壓', '氣象預報'],
         'title': '太平洋熱帶低壓距離遠對台暫無影響 18日後動線更明朗'},
        {'link': 'https://news.pts.org.tw/article/540096',
         'tags': ['病毒株', '族群', '醫師', '危險', '哥倫比亞', '突破性感染'],
         'title': '變種病毒提高「突破性感染」機率 醫：已接種高危族群仍要留意'},
        {'link': 'https://news.pts.org.tw/article/540095',
         'tags': ['五倍券', '支持度', '現金', '消基會', '振興經濟', '發現金'],
         'title': '五倍劵議題2萬人網路民調出爐 消基會：9成盼發放現金'},
        {'link': 'https://news.pts.org.tw/article/540085',
         'tags': ['長榮航空', '安全', '關島'],
         'title': '長榮飛關島落地摩擦 重飛後安全降落'}],
 '產經': [{'link': 'https://news.pts.org.tw/article/540094',
         'tags': ['彰化', '伸港', '損失'],
         'title': '連日大雨沖淡海水鹽度 彰化伸港、線西牡蠣供應量剩不到兩成'}],
 '社會': [{'link': 'https://news.pts.org.tw/article/540100',
         'tags': ['防疫警戒', '傳染病防治法', '警方'],
         'title': '12人民宅聚賭未開局就被抓 警現場查獲最高罰360萬'},
        {'link': 'https://news.pts.org.tw/article/540099',
         'tags': ['官司', '被害人', '中山分局', '車輛', '濫權'],
         'title': '便衣警認錯車誤衝撞還開槍 國賠官司判警違法濫權要賠36萬'}]}
'''



#我在這邊測試一下
all_news_tag = {}
    '''<======= 分類存進 all_news_tag =======>'''
    if tag not in all_news_tag:
        all_news_tag[tag] = []
    all_news_tag[tag].append({"title":title, "link":link, "tags":list(tags)})

pprint(all_news_tag)